In [1]:
import pandas as pd

In [2]:
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['Aammar', 'Amaar', 'Hamza', 'Hazma'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}
# make pandas dataframe
df = pd.DataFrame(data)

In [3]:
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Aammar       100.0         NaN
1  01-12-2022         U.S.A.   Amaar       200.0       150.0
2  2022/12/01        America   Hamza         NaN       300.0
3  12-01-2021  United States   Hazma       200.0       150.0

In [28]:
# standardizing the date format
df['date'] = pd.to_datetime(df['date'], errors='coerce')
df['date'] = df['date'].dt.strftime('%Y-%m-%d')
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Aammar       100.0         NaN
1         NaN         U.S.A.   Amaar       200.0       150.0
2         NaN        America   Hamza         NaN       300.0
3         NaN  United States   Hazma       200.0       150.0

# Assignment: Impute fill the date and try another method to complete the date format inconsitencies

In [9]:


# Standardizing the date format
df['date'] = pd.to_datetime(df['date'], errors='coerce')
df['date'] = df['date'].dt.strftime('%d-%m-%Y')

# Fill missing dates with a default date (e.g., '2022-01-01')
default_date = pd.to_datetime('2022-01-01')
df['date'] = df['date'].fillna(default_date)

print(df)

         date        country    name  sales_2020  sales_2021
0  12-01-2021            USA  Aammar       100.0         NaN
1  01-01-2022         U.S.A.   Amaar       200.0       150.0
2  01-01-2022        America   Hamza         NaN       300.0
3  01-01-2022  United States   Hazma       200.0       150.0

In [29]:
# Harmonize the name of the coutry
country_mapping = {'USA': 'United States', 'U.S.A.': 'United States', 'America': 'United States'}
df['country'] = df['country'].replace(country_mapping)
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01  United States  Aammar       100.0         NaN
1         NaN  United States   Amaar       200.0       150.0
2         NaN  United States   Hamza         NaN       300.0
3         NaN  United States   Hazma       200.0       150.0

In [30]:
# Correct the typographical Mistakes in name
# Let's assume we want to correct 'Jonh Doe' to 'John Doe'
df['name'] = df['name'].replace({'Amaar': 'Aammar', 'Hazma': 'Hamza'})
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01  United States  Aammar       100.0         NaN
1         NaN  United States  Aammar       200.0       150.0
2         NaN  United States   Hamza         NaN       300.0
3         NaN  United States   Hamza       200.0       150.0

In [24]:
# remove duplicates
df = df.drop_duplicates(subset="name")
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01  United States  Aammar       100.0         NaN
2         NaN  United States   Hamza         NaN       300.0

In [31]:
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01  United States  Aammar       100.0         NaN
1         NaN  United States  Aammar       200.0       150.0
2         NaN  United States   Hamza         NaN       300.0
3         NaN  United States   Hamza       200.0       150.0

In [32]:
# 5. Resolving Contradictory Data
# For demonstration, let's assume sales_2021 should always be higher than sales_2020
# We'll remove rows where this condition is not met
df = df.drop(df[df['sales_2021'] <= df['sales_2020']].index)
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01  United States  Aammar       100.0         NaN
2         NaN  United States   Hamza         NaN       300.0

# use a dataset to do this

In [1]:
import pandas as pd

# Creating a new dataset with inconsistencies
data = {
    'order_date': ['2022-03-01', '03/05/2022', '2022/03/10', '05-03-22', None, '10-03-2022', '2022-03-15'],
    'customer_id': [101, 102, None, 103, 102, 104, None],
    'product': ['Laptop', 'Smartphone', 'Smartphone', 'Laptop', 'Tablet', 'Tablet', None],
    'quantity': [1, 2, None, 1, 2, None, 1],
    'price': [1200.0, 850.0, 850.0, 1200.0, None, 600.0, 600.0],
    'country': ['USA', 'U.S.A.', 'United States', 'USA', 'America', 'United States of America', 'U.S.A.'],
    'status': ['Completed', 'Shipped', None, 'Cancelled', 'Completed', 'Shipped', 'Completed']
}

df = pd.DataFrame(data)

# Displaying the dataset
print("Inconsistent Dataset:")
print(df)

Inconsistent Dataset:
   order_date  customer_id     product  quantity   price  \
0  2022-03-01        101.0      Laptop       1.0  1200.0
1  03/05/2022        102.0  Smartphone       2.0   850.0
2  2022/03/10          NaN  Smartphone       NaN   850.0
3    05-03-22        103.0      Laptop       1.0  1200.0
4        None        102.0      Tablet       2.0     NaN
5  10-03-2022        104.0      Tablet       NaN   600.0
6  2022-03-15          NaN        None       1.0   600.0

                    country     status
0                       USA  Completed
1                    U.S.A.    Shipped
2             United States       None
3                       USA  Cancelled
4                   America  Completed
5  United States of America    Shipped
6                    U.S.A.  Completed

In [18]:
df.head()

,order_date,customer_id,product,quantity,price,country,status
0,2022-03-01,101.0,Laptop,1.0,1200.0,United States,Completed
1,2022-03-01,102.0,Smartphone,2.0,850.0,United States,Shipped
2,2022-03-01,999.0,Smartphone,1.0,850.0,United States,Pending
3,2022-03-01,103.0,Laptop,1.0,1200.0,United States,Cancelled
4,2022-03-01,102.0,Tablet,2.0,NaN,United States,Completed

In [3]:
# Standardize the date format
df['order_date'] = pd.to_datetime(df['order_date'], errors='coerce')

In [7]:
# Fill missing dates with a default date (e.g., '2022-01-01')
df['order_date'] = df['order_date'].fillna(pd.to_datetime('2022-03-01'))

In [17]:
df['customer_id'] = df['customer_id'].fillna(999)

In [11]:
# Standardize country names
country_mapping = {
    'USA': 'United States',
    'U.S.A.': 'United States',
    'America': 'United States',
    'United States of America': 'United States'
}
df['country'] = df['country'].replace(country_mapping)

In [13]:
# Fill missing quantities with a default value (e.g., 1)
df['quantity'] = df['quantity'].fillna(1)

In [15]:
# Fill missing statuses with 'Pending'
df['status'] = df['status'].fillna('Pending')